# GroupBy Aggregation with Relabeling

In [1]:
import pandas as pd

In [2]:
tit = pd.read_csv("../Course_Materials_Part2/Video_Lecture_NBs/titanic.csv", 
                  usecols=["survived", "pclass", "sex", "age", "fare"])

In [3]:
tit.head()

   survived  pclass     sex   age     fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [9]:
tit.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [11]:
tit.groupby("sex").agg(survival_rate = ("survived", "mean"))

        survival_rate
sex
female       0.742038
male         0.188908

In [12]:
tit.groupby("sex").agg({"survived": ["sum", "mean"], "age": ["mean"]})

       survived                  age
            sum      mean       mean
sex
female      233  0.742038  27.915709
male        109  0.188908  30.726645

In [15]:
tit.groupby("sex").agg(survived_total = ("survived", "sum"),
                       survived_rate = ("survived", "mean"),
                       mean_age = ("age", "mean"))

        survived_total  survived_rate   mean_age
sex
female             233       0.742038  27.915709
male               109       0.188908  30.726645